experiment/results/no_istio_20260105_150251/wrk_logs/wrk_2000rps_rep1.log
Running 2m test @ http://localhost:31643
  4 threads and 100 connections

  Thread calibration: mean lat.: 39.548ms, rate sampling interval: 193ms
  Thread calibration: mean lat.: 36.039ms, rate sampling interval: 178ms
  Thread calibration: mean lat.: 39.824ms, rate sampling interval: 196ms
  Thread calibration: mean lat.: 35.134ms, rate sampling interval: 177ms

-----------------------------------------------------------------------
Test Results @ http://localhost:31643 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    44.72ms   51.26ms 230.01ms   86.61%
    Req/Sec   502.03     61.09   646.00     69.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.68ms
 75.000%   65.98ms
 90.000%  110.21ms
 99.000%  230.01ms
 99.900%  357.89ms
 99.990%  488.45ms
 99.999%  558.08ms
100.000%  561.15ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.030     0.000000            1         1.00
       2.337     0.100000        22056         1.11
       4.867     0.200000        44090         1.25
       8.647     0.300000        66148         1.43
      14.847     0.400000        88187         1.67
      27.679     0.500000       110232         2.00
      34.527     0.550000       121239         2.22
      41.375     0.600000       132262         2.50
      48.671     0.650000       143282         2.86
      56.735     0.700000       154329         3.33
      65.983     0.750000       165320         4.00
      71.167     0.775000       170853         4.44
      76.927     0.800000       176357         5.00
      83.327     0.825000       181880         5.71
      90.687     0.850000       187410         6.67
      99.391     0.875000       192874         8.00
     104.575     0.887500       195651         8.89
     110.207     0.900000       198387        10.00
     116.991     0.912500       201151        11.43
     124.415     0.925000       203911        13.33
     133.247     0.937500       206655        16.00
     138.879     0.943750       208039        17.78
     145.023     0.950000       209414        20.00
     152.063     0.956250       210794        22.86
     160.255     0.962500       212158        26.67
     169.471     0.968750       213541        32.00
     175.359     0.971875       214239        35.56
     181.631     0.975000       214921        40.00
     188.927     0.978125       215602        45.71
     196.863     0.981250       216293        53.33
     205.951     0.984375       216980        64.00
     211.711     0.985938       217325        71.11
     217.983     0.987500       217672        80.00
     224.895     0.989062       218014        91.43
     233.983     0.990625       218360       106.67
     244.479     0.992188       218703       128.00
     249.855     0.992969       218874       142.22
     257.663     0.993750       219048       160.00
     264.959     0.994531       219219       182.86
     274.175     0.995313       219390       213.33
     284.927     0.996094       219563       256.00
     290.815     0.996484       219650       284.44
     296.959     0.996875       219738       320.00
     304.639     0.997266       219823       365.71
     313.855     0.997656       219908       426.67
     324.863     0.998047       219996       512.00
     330.751     0.998242       220039       568.89
     336.639     0.998437       220080       640.00
     342.271     0.998633       220122       731.43
     349.695     0.998828       220165       853.33
     359.423     0.999023       220209      1024.00
     365.823     0.999121       220232      1137.78
     373.759     0.999219       220251      1280.00
     379.903     0.999316       220273      1462.86
     389.631     0.999414       220294      1706.67
     399.359     0.999512       220316      2048.00
     406.015     0.999561       220327      2275.56
     413.183     0.999609       220337      2560.00
     421.119     0.999658       220348      2925.71
     427.775     0.999707       220359      3413.33
     440.319     0.999756       220370      4096.00
     450.815     0.999780       220375      4551.11
     453.375     0.999805       220380      5120.00
     460.799     0.999829       220387      5851.43
     464.895     0.999854       220391      6826.67
     481.535     0.999878       220397      8192.00
     485.887     0.999890       220399      9102.22
     488.703     0.999902       220402     10240.00
     501.247     0.999915       220405     11702.86
     513.791     0.999927       220407     13653.33
     529.919     0.999939       220410     16384.00
     530.431     0.999945       220411     18204.44
     540.671     0.999951       220415     20480.00
     540.671     0.999957       220415     23405.71
     540.671     0.999963       220415     27306.67
     545.279     0.999969       220417     32768.00
     545.279     0.999973       220417     36408.89
     550.911     0.999976       220418     40960.00
     551.423     0.999979       220419     46811.43
     551.423     0.999982       220419     54613.33
     555.007     0.999985       220420     65536.00
     555.007     0.999986       220420     72817.78
     558.079     0.999988       220421     81920.00
     558.079     0.999989       220421     93622.86
     558.079     0.999991       220421    109226.67
     559.615     0.999992       220422    131072.00
     559.615     0.999993       220422    145635.56
     559.615     0.999994       220422    163840.00
     559.615     0.999995       220422    187245.71
     559.615     0.999995       220422    218453.33
     561.151     0.999996       220423    262144.00
     561.151     1.000000       220423          inf
#[Mean    =       44.717, StdDeviation   =       51.259]
#[Max     =      560.640, Total count    =       220423]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  240219 requests in 2.00m, 84.07MB read
Requests/sec:   2001.83  
Transfer/sec:    717.39KB