experiment/results/no_istio_20260105_150251/wrk_logs/wrk_500rps_rep1.log
Running 2m test @ http://localhost:31643
  4 threads and 100 connections

  Thread calibration: mean lat.: 8.190ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 10.418ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 10.761ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 9.729ms, rate sampling interval: 44ms

-----------------------------------------------------------------------
Test Results @ http://localhost:31643 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    10.89ms   17.33ms  47.04ms   91.05%
    Req/Sec   125.50     54.28   268.00     67.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.15ms
 75.000%   17.49ms
 90.000%   27.15ms
 99.000%   47.04ms
 99.900%  240.90ms
 99.990%  360.45ms
 99.999%  399.36ms
100.000%  406.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.606     0.000000            1         1.00
       1.793     0.100000         5484         1.11
       2.089     0.200000        10971         1.25
       2.509     0.300000        16448         1.43
       3.417     0.400000        21927         1.67
       4.151     0.500000        27412         2.00
       4.575     0.550000        30163         2.22
       5.207     0.600000        32883         2.50
       7.019     0.650000        35624         2.86
      15.087     0.700000        38367         3.33
      17.487     0.750000        41105         4.00
      18.607     0.775000        42482         4.44
      19.855     0.800000        43849         5.00
      21.247     0.825000        45220         5.71
      22.911     0.850000        46590         6.67
      24.799     0.875000        47959         8.00
      25.903     0.887500        48644         8.89
      27.151     0.900000        49332        10.00
      28.447     0.912500        50016        11.43
      29.903     0.925000        50699        13.33
      31.487     0.937500        51388        16.00
      32.351     0.943750        51727        17.78
      33.407     0.950000        52076        20.00
      34.559     0.956250        52408        22.86
      35.743     0.962500        52752        26.67
      37.215     0.968750        53097        32.00
      38.047     0.971875        53264        35.56
      38.943     0.975000        53438        40.00
      39.999     0.978125        53614        45.71
      41.215     0.981250        53778        53.33
      42.847     0.984375        53956        64.00
      43.807     0.985938        54038        71.11
      44.703     0.987500        54122        80.00
      45.983     0.989062        54208        91.43
      48.031     0.990625        54293       106.67
      52.895     0.992188        54377       128.00
      57.247     0.992969        54420       142.22
      65.471     0.993750        54463       160.00
      79.615     0.994531        54506       182.86
      83.711     0.995313        54549       213.33
     119.679     0.996094        54591       256.00
     133.247     0.996484        54613       284.44
     143.615     0.996875        54634       320.00
     156.159     0.997266        54656       365.71
     164.095     0.997656        54677       426.67
     184.831     0.998047        54698       512.00
     204.031     0.998242        54709       568.89
     209.919     0.998437        54720       640.00
     213.247     0.998633        54731       731.43
     228.863     0.998828        54741       853.33
     255.231     0.999023        54752      1024.00
     262.911     0.999121        54757      1137.78
     281.343     0.999219        54763      1280.00
     287.743     0.999316        54768      1462.86
     292.351     0.999414        54773      1706.67
     316.671     0.999512        54779      2048.00
     320.511     0.999561        54781      2275.56
     328.959     0.999609        54784      2560.00
     335.359     0.999658        54787      2925.71
     336.383     0.999707        54789      3413.33
     344.063     0.999756        54792      4096.00
     344.575     0.999780        54793      4551.11
     351.743     0.999805        54795      5120.00
     351.999     0.999829        54796      5851.43
     353.023     0.999854        54797      6826.67
     356.351     0.999878        54799      8192.00
     356.351     0.999890        54799      9102.22
     360.447     0.999902        54800     10240.00
     361.727     0.999915        54801     11702.86
     361.727     0.999927        54801     13653.33
     366.079     0.999939        54802     16384.00
     366.079     0.999945        54802     18204.44
     382.207     0.999951        54803     20480.00
     382.207     0.999957        54803     23405.71
     382.207     0.999963        54803     27306.67
     399.359     0.999969        54804     32768.00
     399.359     0.999973        54804     36408.89
     399.359     0.999976        54804     40960.00
     399.359     0.999979        54804     46811.43
     399.359     0.999982        54804     54613.33
     406.015     0.999985        54805     65536.00
     406.015     1.000000        54805          inf
#[Mean    =       10.888, StdDeviation   =       17.332]
#[Max     =      405.760, Total count    =        54805]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  59790 requests in 2.00m, 51.10MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:    498.15  
Transfer/sec:    435.98KB